grevaillot/svd_tools/headers/STM32L4x2/rcc.h
#define RCC_PLLCFGR_PLLPDIV_SHIFT		27
#define RCC_PLLCFGR_PLLPDIV_MASK		0x1f
/** @defgroup rcc_pllcfgr_pllpdiv PLLPDIV Main PLL division factor for PLLSAI2CLK
@{*/
/**@}*/


#define RCC_PLLCFGR_PLLR_SHIFT		25
#define RCC_PLLCFGR_PLLR_MASK		0x03
/** @defgroup rcc_pllcfgr_pllr PLLR Main PLL division factor for PLLCLK (system clock)
@{*/
/**@}*/

/** RCC_PLLCFGR_PLLREN Main PLL PLLCLK output enable **/
#define RCC_PLLCFGR_PLLREN		(1 << 24)

#define RCC_PLLCFGR_PLLQ_SHIFT		21
#define RCC_PLLCFGR_PLLQ_MASK		0x03
/** @defgroup rcc_pllcfgr_pllq PLLQ Main PLL division factor for PLLUSB1CLK(48 MHz clock)
@{*/
/**@}*/

/** RCC_PLLCFGR_PLLQEN Main PLL PLLUSB1CLK output enable **/
#define RCC_PLLCFGR_PLLQEN		(1 << 20)
/** RCC_PLLCFGR_PLLP Main PLL division factor for PLLSAI3CLK (SAI1 and SAI2 clock) **/
#define RCC_PLLCFGR_PLLP		(1 << 17)
/** RCC_PLLCFGR_PLLPEN Main PLL PLLSAI3CLK output enable **/
#define RCC_PLLCFGR_PLLPEN		(1 << 16)

#define RCC_PLLCFGR_PLLN_SHIFT		8
#define RCC_PLLCFGR_PLLN_MASK		0x7f
/** @defgroup rcc_pllcfgr_plln PLLN Main PLL multiplication factor for VCO
@{*/
/**@}*/


#define RCC_PLLCFGR_PLLM_SHIFT		4
#define RCC_PLLCFGR_PLLM_MASK		0x07
/** @defgroup rcc_pllcfgr_pllm PLLM Division factor for the main PLL and audio PLL (PLLSAI1 and PLLSAI2) input clock
@{*/
/**@}*/


#define RCC_PLLCFGR_PLLSRC_SHIFT		0
#define RCC_PLLCFGR_PLLSRC_MASK		0x03
/** @defgroup rcc_pllcfgr_pllsrc PLLSRC Main PLL, PLLSAI1 and PLLSAI2 entry clock source
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllsai1cfgr PLLSAI1CFGR PLLSAI1 configuration register
@{*/


#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_SHIFT		27
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_MASK		0x1f
/** @defgroup rcc_pllsai1cfgr_pllsai1pdiv PLLSAI1PDIV PLLSAI1 division factor for PLLSAI1CLK
@{*/
/**@}*/


#define RCC_PLLSAI1CFGR_PLLSAI1R_SHIFT		25
#define RCC_PLLSAI1CFGR_PLLSAI1R_MASK		0x03
/** @defgroup rcc_pllsai1cfgr_pllsai1r PLLSAI1R PLLSAI1 division factor for PLLADC1CLK (ADC clock)
@{*/
/**@}*/

/** RCC_PLLSAI1CFGR_PLLSAI1REN PLLSAI1 PLLADC1CLK output enable **/
#define RCC_PLLSAI1CFGR_PLLSAI1REN		(1 << 24)

#define RCC_PLLSAI1CFGR_PLLSAI1Q_SHIFT		21
#define RCC_PLLSAI1CFGR_PLLSAI1Q_MASK		0x03
/** @defgroup rcc_pllsai1cfgr_pllsai1q PLLSAI1Q SAI1PLL division factor for PLLUSB2CLK (48 MHz clock)
@{*/
/**@}*/

/** RCC_PLLSAI1CFGR_PLLSAI1QEN SAI1PLL PLLUSB2CLK output enable **/
#define RCC_PLLSAI1CFGR_PLLSAI1QEN		(1 << 20)
/** RCC_PLLSAI1CFGR_PLLSAI1P SAI1PLL division factor for PLLSAI1CLK (SAI1 or SAI2 clock) **/
#define RCC_PLLSAI1CFGR_PLLSAI1P		(1 << 17)
/** RCC_PLLSAI1CFGR_PLLSAI1PEN SAI1PLL PLLSAI1CLK output enable **/
#define RCC_PLLSAI1CFGR_PLLSAI1PEN		(1 << 16)

#define RCC_PLLSAI1CFGR_PLLSAI1N_SHIFT		8
#define RCC_PLLSAI1CFGR_PLLSAI1N_MASK		0x7f
/** @defgroup rcc_pllsai1cfgr_pllsai1n PLLSAI1N SAI1PLL multiplication factor for VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cier CIER Clock interrupt enable register
@{*/

/** RCC_CIER_HSI48RDYIE HSI48 ready interrupt enable **/
#define RCC_CIER_HSI48RDYIE		(1 << 10)
/** RCC_CIER_LSECSSIE LSE clock security system interrupt enable **/
#define RCC_CIER_LSECSSIE		(1 << 9)
/** RCC_CIER_PLLSAI1RDYIE PLLSAI1 ready interrupt enable **/
#define RCC_CIER_PLLSAI1RDYIE		(1 << 6)
/** RCC_CIER_PLLRDYIE PLL ready interrupt enable **/
#define RCC_CIER_PLLRDYIE		(1 << 5)
/** RCC_CIER_HSERDYIE HSE ready interrupt enable **/
#define RCC_CIER_HSERDYIE		(1 << 4)
/** RCC_CIER_HSIRDYIE HSI ready interrupt enable **/
#define RCC_CIER_HSIRDYIE		(1 << 3)
/** RCC_CIER_MSIRDYIE MSI ready interrupt enable **/
#define RCC_CIER_MSIRDYIE		(1 << 2)
/** RCC_CIER_LSERDYIE LSE ready interrupt enable **/
#define RCC_CIER_LSERDYIE		(1 << 1)
/** RCC_CIER_LSIRDYIE LSI ready interrupt enable **/
#define RCC_CIER_LSIRDYIE		(1 << 0)

/**@}*/

/** @defgroup rcc_cifr CIFR Clock interrupt flag register
@{*/

/** RCC_CIFR_HSI48RDYF HSI48 ready interrupt flag **/
#define RCC_CIFR_HSI48RDYF		(1 << 10)
/** RCC_CIFR_LSECSSF LSE Clock security system interrupt flag **/
#define RCC_CIFR_LSECSSF		(1 << 9)
/** RCC_CIFR_CSSF Clock security system interrupt flag **/
#define RCC_CIFR_CSSF		(1 << 8)
/** RCC_CIFR_PLLSAI1RDYF PLLSAI1 ready interrupt flag **/
#define RCC_CIFR_PLLSAI1RDYF		(1 << 6)
/** RCC_CIFR_PLLRDYF PLL ready interrupt flag **/
#define RCC_CIFR_PLLRDYF		(1 << 5)
/** RCC_CIFR_HSERDYF HSE ready interrupt flag **/
#define RCC_CIFR_HSERDYF		(1 << 4)
/** RCC_CIFR_HSIRDYF HSI ready interrupt flag **/
#define RCC_CIFR_HSIRDYF		(1 << 3)
/** RCC_CIFR_MSIRDYF MSI ready interrupt flag **/
#define RCC_CIFR_MSIRDYF		(1 << 2)
/** RCC_CIFR_LSERDYF LSE ready interrupt flag **/
#define RCC_CIFR_LSERDYF		(1 << 1)
/** RCC_CIFR_LSIRDYF LSI ready interrupt flag **/
#define RCC_CIFR_LSIRDYF		(1 << 0)

/**@}*/

/** @defgroup rcc_cicr CICR Clock interrupt clear register
@{*/

/** RCC_CICR_HSI48RDYC HSI48 oscillator ready interrupt clear **/
#define RCC_CICR_HSI48RDYC		(1 << 10)
/** RCC_CICR_LSECSSC LSE Clock security system interrupt clear **/
#define RCC_CICR_LSECSSC		(1 << 9)
/** RCC_CICR_CSSC Clock security system interrupt clear **/
#define RCC_CICR_CSSC		(1 << 8)
/** RCC_CICR_PLLSAI1RDYC PLLSAI1 ready interrupt clear **/
#define RCC_CICR_PLLSAI1RDYC		(1 << 6)
/** RCC_CICR_PLLRDYC PLL ready interrupt clear **/
#define RCC_CICR_PLLRDYC		(1 << 5)
/** RCC_CICR_HSERDYC HSE ready interrupt clear **/
#define RCC_CICR_HSERDYC		(1 << 4)
/** RCC_CICR_HSIRDYC HSI ready interrupt clear **/
#define RCC_CICR_HSIRDYC		(1 << 3)
/** RCC_CICR_MSIRDYC MSI ready interrupt clear **/
#define RCC_CICR_MSIRDYC		(1 << 2)
/** RCC_CICR_LSERDYC LSE ready interrupt clear **/
#define RCC_CICR_LSERDYC		(1 << 1)
/** RCC_CICR_LSIRDYC LSI ready interrupt clear **/
#define RCC_CICR_LSIRDYC		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1rstr AHB1RSTR AHB1 peripheral reset register
@{*/

/** RCC_AHB1RSTR_TSCRST Touch Sensing Controller reset **/
#define RCC_AHB1RSTR_TSCRST		(1 << 16)
/** RCC_AHB1RSTR_CRCRST CRC reset **/
#define RCC_AHB1RSTR_CRCRST		(1 << 11)
/** RCC_AHB1RSTR_FLASHRST Flash memory interface reset **/
#define RCC_AHB1RSTR_FLASHRST		(1 << 8)
/** RCC_AHB1RSTR_DMA2RST DMA2 reset **/
#define RCC_AHB1RSTR_DMA2RST		(1 << 1)
/** RCC_AHB1RSTR_DMA1RST DMA1 reset **/
#define RCC_AHB1RSTR_DMA1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2rstr AHB2RSTR AHB2 peripheral reset register
@{*/

