grevaillot/svd_tools/headers/STM32L4x2/rcc.h
/** RCC_AHB2RSTR_RNGRST Random number generator reset **/
#define RCC_AHB2RSTR_RNGRST		(1 << 18)
/** RCC_AHB2RSTR_AESRST AES hardware accelerator reset **/
#define RCC_AHB2RSTR_AESRST		(1 << 16)
/** RCC_AHB2RSTR_ADCRST ADC reset **/
#define RCC_AHB2RSTR_ADCRST		(1 << 13)
/** RCC_AHB2RSTR_GPIOHRST IO port H reset **/
#define RCC_AHB2RSTR_GPIOHRST		(1 << 7)
/** RCC_AHB2RSTR_GPIOERST IO port E reset **/
#define RCC_AHB2RSTR_GPIOERST		(1 << 4)
/** RCC_AHB2RSTR_GPIODRST IO port D reset **/
#define RCC_AHB2RSTR_GPIODRST		(1 << 3)
/** RCC_AHB2RSTR_GPIOCRST IO port C reset **/
#define RCC_AHB2RSTR_GPIOCRST		(1 << 2)
/** RCC_AHB2RSTR_GPIOBRST IO port B reset **/
#define RCC_AHB2RSTR_GPIOBRST		(1 << 1)
/** RCC_AHB2RSTR_GPIOARST IO port A reset **/
#define RCC_AHB2RSTR_GPIOARST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3rstr AHB3RSTR AHB3 peripheral reset register
@{*/

/** RCC_AHB3RSTR_QSPIRST Quad SPI memory interface reset **/
#define RCC_AHB3RSTR_QSPIRST		(1 << 8)

/**@}*/

/** @defgroup rcc_apb1rstr1 APB1RSTR1 APB1 peripheral reset register 1
@{*/

/** RCC_APB1RSTR1_LPTIM1RST Low Power Timer 1 reset **/
#define RCC_APB1RSTR1_LPTIM1RST		(1 << 31)
/** RCC_APB1RSTR1_OPAMPRST OPAMP interface reset **/
#define RCC_APB1RSTR1_OPAMPRST		(1 << 30)
/** RCC_APB1RSTR1_DAC1RST DAC1 interface reset **/
#define RCC_APB1RSTR1_DAC1RST		(1 << 29)
/** RCC_APB1RSTR1_PWRRST Power interface reset **/
#define RCC_APB1RSTR1_PWRRST		(1 << 28)
/** RCC_APB1RSTR1_USBFSRST USB FS reset **/
#define RCC_APB1RSTR1_USBFSRST		(1 << 26)
/** RCC_APB1RSTR1_CAN1RST CAN1 reset **/
#define RCC_APB1RSTR1_CAN1RST		(1 << 25)
/** RCC_APB1RSTR1_CRSRST CRS reset **/
#define RCC_APB1RSTR1_CRSRST		(1 << 24)
/** RCC_APB1RSTR1_I2C3RST I2C3 reset **/
#define RCC_APB1RSTR1_I2C3RST		(1 << 23)
/** RCC_APB1RSTR1_I2C2RST I2C2 reset **/
#define RCC_APB1RSTR1_I2C2RST		(1 << 22)
/** RCC_APB1RSTR1_I2C1RST I2C1 reset **/
#define RCC_APB1RSTR1_I2C1RST		(1 << 21)
/** RCC_APB1RSTR1_USART4RST USART4 reset. **/
#define RCC_APB1RSTR1_USART4RST		(1 << 19)
/** RCC_APB1RSTR1_USART1RST USART1 reset **/
#define RCC_APB1RSTR1_USART1RST		(1 << 18)
/** RCC_APB1RSTR1_USART2RST USART2 reset **/
#define RCC_APB1RSTR1_USART2RST		(1 << 17)
/** RCC_APB1RSTR1_SPI3RST SPI3 reset **/
#define RCC_APB1RSTR1_SPI3RST		(1 << 15)
/** RCC_APB1RSTR1_SPI2RST SPI2 reset **/
#define RCC_APB1RSTR1_SPI2RST		(1 << 14)
/** RCC_APB1RSTR1_LCDRST LCD interface reset **/
#define RCC_APB1RSTR1_LCDRST		(1 << 9)
/** RCC_APB1RSTR1_TIM7RST TIM7 timer reset **/
#define RCC_APB1RSTR1_TIM7RST		(1 << 5)
/** RCC_APB1RSTR1_TIM6RST TIM6 timer reset **/
#define RCC_APB1RSTR1_TIM6RST		(1 << 4)
/** RCC_APB1RSTR1_TIM2RST TIM2 timer reset **/
#define RCC_APB1RSTR1_TIM2RST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1rstr2 APB1RSTR2 APB1 peripheral reset register 2
@{*/

/** RCC_APB1RSTR2_LPTIM2RST Low-power timer 2 reset **/
#define RCC_APB1RSTR2_LPTIM2RST		(1 << 5)
/** RCC_APB1RSTR2_SWPMI1RST Single wire protocol reset **/
#define RCC_APB1RSTR2_SWPMI1RST		(1 << 2)
/** RCC_APB1RSTR2_I2C4RST I2C4 reset **/
#define RCC_APB1RSTR2_I2C4RST		(1 << 1)
/** RCC_APB1RSTR2_LPUART1RST Low-power UART 1 reset **/
#define RCC_APB1RSTR2_LPUART1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2rstr APB2RSTR APB2 peripheral reset register
@{*/

/** RCC_APB2RSTR_DFSDMRST DFSDM filter reset **/
#define RCC_APB2RSTR_DFSDMRST		(1 << 24)
/** RCC_APB2RSTR_SAI1RST Serial audio interface 1 (SAI1) reset **/
#define RCC_APB2RSTR_SAI1RST		(1 << 21)
/** RCC_APB2RSTR_TIM16RST TIM16 timer reset **/
#define RCC_APB2RSTR_TIM16RST		(1 << 17)
/** RCC_APB2RSTR_TIM15RST TIM15 timer reset **/
#define RCC_APB2RSTR_TIM15RST		(1 << 16)
/** RCC_APB2RSTR_USART1RST USART1 reset **/
#define RCC_APB2RSTR_USART1RST		(1 << 14)
/** RCC_APB2RSTR_SPI1RST SPI1 reset **/
#define RCC_APB2RSTR_SPI1RST		(1 << 12)
/** RCC_APB2RSTR_TIM1RST TIM1 timer reset **/
#define RCC_APB2RSTR_TIM1RST		(1 << 11)
/** RCC_APB2RSTR_SDMMCRST SDMMC reset **/
#define RCC_APB2RSTR_SDMMCRST		(1 << 10)
/** RCC_APB2RSTR_SYSCFGRST System configuration (SYSCFG) reset **/
#define RCC_APB2RSTR_SYSCFGRST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1enr AHB1ENR AHB1 peripheral clock enable register
@{*/

/** RCC_AHB1ENR_TSCEN Touch Sensing Controller clock enable **/
#define RCC_AHB1ENR_TSCEN		(1 << 16)
/** RCC_AHB1ENR_CRCEN CRC clock enable **/
#define RCC_AHB1ENR_CRCEN		(1 << 12)
/** RCC_AHB1ENR_FLASHEN Flash memory interface clock enable **/
#define RCC_AHB1ENR_FLASHEN		(1 << 8)
/** RCC_AHB1ENR_DMA2EN DMA2 clock enable **/
#define RCC_AHB1ENR_DMA2EN		(1 << 1)
/** RCC_AHB1ENR_DMA1EN DMA1 clock enable **/
#define RCC_AHB1ENR_DMA1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2enr AHB2ENR AHB2 peripheral clock enable register
@{*/

/** RCC_AHB2ENR_RNGEN Random Number Generator clock enable **/
#define RCC_AHB2ENR_RNGEN		(1 << 18)
/** RCC_AHB2ENR_AESEN AES accelerator clock enable **/
#define RCC_AHB2ENR_AESEN		(1 << 16)
/** RCC_AHB2ENR_ADCEN ADC clock enable **/
#define RCC_AHB2ENR_ADCEN		(1 << 13)
/** RCC_AHB2ENR_GPIOHEN IO port H clock enable **/
#define RCC_AHB2ENR_GPIOHEN		(1 << 7)
/** RCC_AHB2ENR_GPIOEEN IO port E clock enable **/
#define RCC_AHB2ENR_GPIOEEN		(1 << 4)
/** RCC_AHB2ENR_GPIODEN IO port D clock enable **/
#define RCC_AHB2ENR_GPIODEN		(1 << 3)
/** RCC_AHB2ENR_GPIOCEN IO port C clock enable **/
#define RCC_AHB2ENR_GPIOCEN		(1 << 2)
/** RCC_AHB2ENR_GPIOBEN IO port B clock enable **/
#define RCC_AHB2ENR_GPIOBEN		(1 << 1)
/** RCC_AHB2ENR_GPIOAEN IO port A clock enable **/
#define RCC_AHB2ENR_GPIOAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3enr AHB3ENR AHB3 peripheral clock enable register
@{*/

/** RCC_AHB3ENR_QSPIEN QSPIEN **/
#define RCC_AHB3ENR_QSPIEN		(1 << 8)

/**@}*/

/** @defgroup rcc_apb1enr1 APB1ENR1 APB1ENR1
@{*/

/** RCC_APB1ENR1_LPTIM1EN Low power timer 1 clock enable **/
#define RCC_APB1ENR1_LPTIM1EN		(1 << 31)
/** RCC_APB1ENR1_OPAMPEN OPAMP interface clock enable **/
#define RCC_APB1ENR1_OPAMPEN		(1 << 30)
/** RCC_APB1ENR1_DAC1EN DAC1 interface clock enable **/
#define RCC_APB1ENR1_DAC1EN		(1 << 29)
/** RCC_APB1ENR1_PWREN Power interface clock enable **/
#define RCC_APB1ENR1_PWREN		(1 << 28)
/** RCC_APB1ENR1_USBF USB FS clock enable **/
#define RCC_APB1ENR1_USBF		(1 << 26)
/** RCC_APB1ENR1_CAN1EN CAN1 clock enable **/
#define RCC_APB1ENR1_CAN1EN		(1 << 25)
/** RCC_APB1ENR1_CRSEN CRS clock enable **/
#define RCC_APB1ENR1_CRSEN		(1 << 24)
/** RCC_APB1ENR1_I2C3EN I2C3 clock enable **/
#define RCC_APB1ENR1_I2C3EN		(1 << 23)
/** RCC_APB1ENR1_I2C2EN I2C2 clock enable **/
#define RCC_APB1ENR1_I2C2EN		(1 << 22)
/** RCC_APB1ENR1_I2C1EN I2C1 clock enable **/
#define RCC_APB1ENR1_I2C1EN		(1 << 21)
/** RCC_APB1ENR1_UART4EN UART4 clock enable **/
#define RCC_APB1ENR1_UART4EN		(1 << 19)
/** RCC_APB1ENR1_USART1EN USART1 clock enable **/
#define RCC_APB1ENR1_USART1EN		(1 << 18)
/** RCC_APB1ENR1_USART2EN USART2 clock enable **/
#define RCC_APB1ENR1_USART2EN		(1 << 17)
/** RCC_APB1ENR1_SPI3EN SPI3 clock enable **/
#define RCC_APB1ENR1_SPI3EN		(1 << 15)
/** RCC_APB1ENR1_SPI1EN SPI1 clock enable **/
#define RCC_APB1ENR1_SPI1EN		(1 << 14)
/** RCC_APB1ENR1_WWDGEN Window watchdog clock enable **/
#define RCC_APB1ENR1_WWDGEN		(1 << 11)
/** RCC_APB1ENR1_RTCAPBEN RTC APB clock enable **/
#define RCC_APB1ENR1_RTCAPBEN		(1 << 10)
/** RCC_APB1ENR1_LCDEN LCD clock enable **/
#define RCC_APB1ENR1_LCDEN		(1 << 9)
/** RCC_APB1ENR1_TIM7EN TIM7 timer clock enable **/
#define RCC_APB1ENR1_TIM7EN		(1 << 5)
/** RCC_APB1ENR1_TIM6EN TIM6 timer clock enable **/
#define RCC_APB1ENR1_TIM6EN		(1 << 4)
/** RCC_APB1ENR1_TIM3EN TIM3 timer clock enable **/
#define RCC_APB1ENR1_TIM3EN		(1 << 1)
/** RCC_APB1ENR1_TIM2EN TIM2 timer clock enable **/
#define RCC_APB1ENR1_TIM2EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1enr2 APB1ENR2 APB1 peripheral clock enable register 2
@{*/

/** RCC_APB1ENR2_DFSDMEN DFSDMEN enable **/
#define RCC_APB1ENR2_DFSDMEN		(1 << 24)
/** RCC_APB1ENR2_LPTIM2EN LPTIM2EN **/
#define RCC_APB1ENR2_LPTIM2EN		(1 << 5)
/** RCC_APB1ENR2_SWPMI1EN Single wire protocol clock enable **/
#define RCC_APB1ENR2_SWPMI1EN		(1 << 2)
/** RCC_APB1ENR2_I2C4EN I2C4 clock enable **/
#define RCC_APB1ENR2_I2C4EN		(1 << 1)
/** RCC_APB1ENR2_LPUART1EN Low power UART 1 clock enable **/
#define RCC_APB1ENR2_LPUART1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2enr APB2ENR APB2ENR
@{*/

/** RCC_APB2ENR_SAI1EN SAI1 clock enable **/
#define RCC_APB2ENR_SAI1EN		(1 << 21)
/** RCC_APB2ENR_TIM16EN TIM16 timer clock enable **/
#define RCC_APB2ENR_TIM16EN		(1 << 17)
/** RCC_APB2ENR_TIM15EN TIM15 timer clock enable **/
#define RCC_APB2ENR_TIM15EN		(1 << 16)
/** RCC_APB2ENR_USART1EN USART1clock enable **/
#define RCC_APB2ENR_USART1EN		(1 << 14)
/** RCC_APB2ENR_SPI1EN SPI1 clock enable **/
#define RCC_APB2ENR_SPI1EN		(1 << 12)
/** RCC_APB2ENR_TIM1EN TIM1 timer clock enable **/
#define RCC_APB2ENR_TIM1EN		(1 << 11)
/** RCC_APB2ENR_SDMMCEN SDMMC clock enable **/
#define RCC_APB2ENR_SDMMCEN		(1 << 10)
/** RCC_APB2ENR_FIREWALLEN Firewall clock enable **/
#define RCC_APB2ENR_FIREWALLEN		(1 << 7)
/** RCC_APB2ENR_SYSCFGEN SYSCFG clock enable **/
#define RCC_APB2ENR_SYSCFGEN		(1 << 0)

/**@}*/

