grevaillot/svd_tools/headers/STM32L4x2/rcc.h
#define RCC_CCIPR_LPTIM2SEL_SHIFT		20
#define RCC_CCIPR_LPTIM2SEL_MASK		0x03
/** @defgroup rcc_ccipr_lptim2sel LPTIM2SEL Low power timer 2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPTIM1SEL_SHIFT		18
#define RCC_CCIPR_LPTIM1SEL_MASK		0x03
/** @defgroup rcc_ccipr_lptim1sel LPTIM1SEL Low power timer 1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C3SEL_SHIFT		16
#define RCC_CCIPR_I2C3SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c3sel I2C3SEL I2C3 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C2SEL_SHIFT		14
#define RCC_CCIPR_I2C2SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c2sel I2C2SEL I2C2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C1SEL_SHIFT		12
#define RCC_CCIPR_I2C1SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c1sel I2C1SEL I2C1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPUART1SEL_SHIFT		10
#define RCC_CCIPR_LPUART1SEL_MASK		0x03
/** @defgroup rcc_ccipr_lpuart1sel LPUART1SEL LPUART1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART4SEL_SHIFT		6
#define RCC_CCIPR_USART4SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart4sel USART4SEL USART4 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART3SEL_SHIFT		4
#define RCC_CCIPR_USART3SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart3sel USART3SEL USART3 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART2SEL_SHIFT		2
#define RCC_CCIPR_USART2SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart2sel USART2SEL USART2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART1SEL_SHIFT		0
#define RCC_CCIPR_USART1SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart1sel USART1SEL USART1 clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_bdcr BDCR BDCR
@{*/

/** RCC_BDCR_LSCOSEL Low speed clock output selection **/
#define RCC_BDCR_LSCOSEL		(1 << 25)
/** RCC_BDCR_LSCOEN Low speed clock output enable **/
#define RCC_BDCR_LSCOEN		(1 << 24)
/** RCC_BDCR_BDRST Backup domain software reset **/
#define RCC_BDCR_BDRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)

#define RCC_BDCR_RTCSEL_SHIFT		8
#define RCC_BDCR_RTCSEL_MASK		0x03
/** @defgroup rcc_bdcr_rtcsel RTCSEL RTC clock source selection
@{*/
/**@}*/

/** RCC_BDCR_LSECSSD LSECSSD **/
#define RCC_BDCR_LSECSSD		(1 << 6)
/** RCC_BDCR_LSECSSON LSECSSON **/
#define RCC_BDCR_LSECSSON		(1 << 5)

#define RCC_BDCR_LSEDRV_SHIFT		3
#define RCC_BDCR_LSEDRV_MASK		0x03
/** @defgroup rcc_bdcr_lsedrv LSEDRV SE oscillator drive capability
@{*/
/**@}*/

/** RCC_BDCR_LSEBYP LSE oscillator bypass **/
#define RCC_BDCR_LSEBYP		(1 << 2)
/** RCC_BDCR_LSERDY LSE oscillator ready **/
#define RCC_BDCR_LSERDY		(1 << 1)
/** RCC_BDCR_LSEON LSE oscillator enable **/
#define RCC_BDCR_LSEON		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR CSR
@{*/

/** RCC_CSR_LPWRSTF Low-power reset flag **/
#define RCC_CSR_LPWRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_IWDGRSTF Independent window watchdog reset flag **/
#define RCC_CSR_IWDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_BORRSTF BOR flag **/
#define RCC_CSR_BORRSTF		(1 << 27)
/** RCC_CSR_PINRSTF Pin reset flag **/
#define RCC_CSR_PINRSTF		(1 << 26)
/** RCC_CSR_OBLRSTF Option byte loader reset flag **/
#define RCC_CSR_OBLRSTF		(1 << 25)
/** RCC_CSR_FIREWALLRSTF Firewall reset flag **/
#define RCC_CSR_FIREWALLRSTF		(1 << 24)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 23)

#define RCC_CSR_MSISRANGE_SHIFT		8
#define RCC_CSR_MSISRANGE_MASK		0x0f
/** @defgroup rcc_csr_msisrange MSISRANGE SI range after Standby mode
@{*/
/**@}*/

/** RCC_CSR_LSIRDY LSI oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION LSI oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_crrcr CRRCR Clock recovery RC register
@{*/


#define RCC_CRRCR_HSI48CAL_SHIFT		7
#define RCC_CRRCR_HSI48CAL_MASK		0x1ff
/** @defgroup rcc_crrcr_hsi48cal HSI48CAL HSI48 clock calibration
@{*/
/**@}*/

/** RCC_CRRCR_HSI48RDY HSI48 clock ready flag **/
#define RCC_CRRCR_HSI48RDY		(1 << 1)
/** RCC_CRRCR_HSI48ON HSI48 clock enable **/
#define RCC_CRRCR_HSI48ON		(1 << 0)

/**@}*/
